fonecmid-diplom/src/DataProcessors/ВКМ_ЗаполнениеГрафика/ВКМ_ЗаполнениеГрафика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_ЗаполнениеГрафика</name>
</mdclass:DataProcessor>

fonecmid-diplom/src/InformationRegisters/ВКМ_ГрафикиРаботы/ВКМ_ГрафикиРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ГрафикиРаботы</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/DataProcessors/ВКМ_ЗаполнениеГрафика/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьГрафик(ДатаНачала, ДатаОкончания) Экспорт 
	
	НаборЗаписей = РегистрыСведений.ВКМ_ГрафикиРаботы.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
	Курсор = ДатаНачала;
	
	Пока Курсор <= ДатаОкончания Цикл 
		
		Запись = РегистрыСведений.ВКМ_ГрафикиРаботы.СоздатьМенеджерЗаписи();
		Запись.Дата = Курсор;
		
		Если ДеньНедели(Курсор) <=5 Тогда
			Запись.Значение = 1;
		Иначе 
			Запись.Значение = 0;
		КонецЕсли;
		
		Запись.Записать();
		Курсор = Курсор + 86400;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
